04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/notchedRoller/0/roller/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/roller";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 297;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    nonCoupleRotating
    {
        type            zeroGradient;
    }

    roller_to_fluid
    {
        type            coupledTemperature;
        value           $internalField;
    }

    solidRoller_on_nonCoupleRotating
    {
        type            coupledTemperature;
        value           $internalField;
    }

    rollerFluid_on_nonCoupleRotating
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
