04_OpenFoam/_ref/OpenFOAM-14/multiRegion/CHT/notchedRoller/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rotating
{
    type        cylinder;
    zoneType    cell;

    point1      (0 0 -1);
    point2      (0 0 1);
    radius      #calc "$<scalar>blockMeshDict!scale*$<scalar>blockMeshDict!R";
}

// ************************************************************************* //
